cf/BusinessProcesses/ПеремещениеТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<BusinessProcess>
		<Properties>
			<Name>ПеремещениеТоваров</Name>
			<Task>Task.ЗадачаПользователю</Task>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Заказчик</Name>
					<Type>
						<v8:Type>cfg:BusinessProcessRef.СборкаЗаказа</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладОтправитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Маршрут</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Маршруты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БыстроеПеремещение</Name>
					<Comment>Будет формировать перемещение товара, имначе отгрузка + приемка</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаказСобран</Name>
					<Comment>Означет что заказ собран и его собирать не нужно из ячеек, а просто переместить по остаткам на другой склад</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОжидающиеПеремещения</Name>
					<Comment>Пока эти перемещения не будут завершены, этот процесс не тронится с места</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Процесс</Name>
							<Type>
								<v8:Type>cfg:BusinessProcessRef.ПеремещениеТоваров</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</BusinessProcess>
</MetaDataObject>

cf/AccumulationRegisters/ТоварыСобранные.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<AccumulationRegister>
		<Properties>
			<Name>ТоварыСобранные</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Заказ</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СборочныйЛист</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СборочныйЛист</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Упаковка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

cf/Enums/СостояниеСборкиЗаказа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>СостояниеСборкиЗаказа</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Возвращено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеСобрано</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжидаетПеремещения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжидаетПоступления</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отгружен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтменаСборки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Перемещается</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Собирается</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СобираетсяИзЯчеек</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Собрано</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отправлен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Доставлен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf/Documents/ПеремещениеТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>ПеремещениеТоваров</Name>
			<BasedOn>
				<xr:Item>Document.ПоступлениеТоваров</xr:Item>
				<xr:Item>Document.ЧекККМ</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ВнутренниеЗаказы</xr:Item>
				<xr:Item>AccumulationRegister.ПартииТоваров</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыСобранные</xr:Item>
				<xr:Item>AccumulationRegister.СборкаЗаказа</xr:Item>
				<xr:Item>AccumulationRegister.ДвижениеТовара</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыВЯчейках</xr:Item>
				<xr:Item>AccumulationRegister.ЗаказыНаПеремещения</xr:Item>
				<xr:Item>AccumulationRegister.ИнтернетЗаказПокупателя</xr:Item>
				<xr:Item>AccumulationRegister.ЗаказыПокупателей</xr:Item>
				<xr:Item>AccumulationRegister.ПриёмщикЗаказа</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыВРезерве</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыНаСкладах</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СкладОтправитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ВнутреннийЗаказ</v8:Type>
						<v8:Type>cfg:BusinessProcessRef.ПеремещениеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ЧекККМ</v8:Type>
						<v8:Type>cfg:BusinessProcessRef.СборкаЗаказа</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СнятьРезерв</Name>
					<Comment>Не будет принимать резерв токо снимать (движения в минус но не в плюс)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтправитьВСборку</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Процесс</Name>
					<Type>
						<v8:Type>cfg:BusinessProcessRef.ЯчеестаяИнвентаризация</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПеремещениеТоваров</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособРазмещенияБезЗаказа</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СборочныйЛист</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СборочныйЛист</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Упаковка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЯчейкаОтправитель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Ячейки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЯчейкаПолучатель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Ячейки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументРезерва</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ВнутреннийЗаказ</v8:Type>
								<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
								<v8:Type>cfg:DocumentRef.ИнтернетЗаказПокупателя</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентРучнойСкидки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентАвтоматическойСкидки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сборщик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РезервЯчеек</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Акция</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.Акция</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Партия</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Партия</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПартии</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

cf/Catalogs/УпаковкиНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>УпаковкиНоменклатуры</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Номенклатура</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Коэффициент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Высота</Name>
					<Comment>Высота упаковки в миллиметрах</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Длина</Name>
					<Comment>Длина упаковки в миллиметрах</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ширина</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Объем</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>7</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВесПустойУпаковки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВесБрутто</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВесНетто</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Закупочная</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автонаименование</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf/BusinessProcesses/ПеремещениеТоваров/Forms/Задача_ОтправитьТовар/Ext/Form/Module.bsl
&НаКлиенте
Перем МассивКомментариев Экспорт;

&НаСервере
Функция СформироватьИПровестиОтправкуТовараИПроверитьБП()
	
	ЗаказСобран = Объект.БизнесПроцесс.ЗаказСобран;
	
	ДанныеЗаказа = ПолучитьДанныеЗаказНаСервере(Объект.БизнесПроцесс);
	
	НачатьТранзакцию();
	
	// Запишем галку процесса если изменилась
	
	Если 	БыстроеПеремещение И
			БыстроеПеремещение <> Объект.Ссылка.БизнесПроцесс.БыстроеПеремещение Тогда
			
		Процесс = Объект.Ссылка.БизнесПроцесс.ПолучитьОбъект();
		Процесс.БыстроеПеремещение = БыстроеПеремещение;
		
		Если Не ОбщиеФункции.ЗаписатьОбъектИСообщитьЕслиОшибка(Процесс) Тогда 
			ОтменитьТранзакцию(); Возврат Ложь; КонецЕсли; КонецЕсли;
	
	// Теперь документ
	ИмяЯчейка = "Ячейка";
	
	Если Товары.Количество() Тогда
		
		// Вытащим товары
		
		ТоварыТЗ = Товары.Выгрузить();
		КонвертацияТипов.УдалитьСтрокиТЗ(ТоварыТЗ, Новый Структура("Количество", 0));
		
		// Заполним документы по разному
		
		Если БыстроеПеремещение Тогда
			
			НовДок = Документы.ПеремещениеТоваров.СоздатьДокумент();
			НовДок.Основание 		= Объект.Ссылка.БизнесПроцесс;
			НовДок.ОтправитьВСборку = ?(БизнесПроцессы.ПеремещениеТоваров.ПолучитьПроцессРодитель(Объект.БизнесПроцесс) = Неопределено, ОтправитьВСборку, Ложь);
			НовДок.СпособРазмещенияБезЗаказа = ДанныеЗаказа.СпособРазмещенияБезЗаказа;
			НовДок.СборочныйЛист = СборочныйЛист;
			
			Если Не ЗаказСобран Тогда  // сборка уже ячейки списала
				//ИмяЯчейка = "ЯчейкаОтправитель";
				//ТоварыТЗ.Колонки.Ячейка.Имя = ИмяЯчейка;
				ТоварыТЗ.Колонки.Добавить("ЯчейкаПолучатель", Новый ОписаниеТипов("СправочникСсылка.Ячейки"));
				ТоварыТЗ.ЗаполнитьЗначения(ЯчейкаПолучатель, "ЯчейкаПолучатель"); КонецЕсли;
			
		Иначе
			
			ИмяЯчейка = "Ячейка";
			НовДок = Документы.ОтгрузкаТоваров.СоздатьДокумент();
			НовДок.Процесс 	= Объект.БизнесПроцесс;
			НовДок.Маршрут 	= Маршрут;
			НовДок.СборочныйЛист = СборочныйЛист;
			
		КонецЕсли;
		
		// подготовим документы по общему
		
		НовДок.Дата 			= ТекущаяДата();
		НовДок.СкладОтправитель = СкладОтправитель;
		НовДок.СкладПолучатель 	= СкладПолучатель;
		
		Если ТоварыТЗ.Количество() Тогда
			
			//// если это последнее перемещение внутреннего заказа тогда создадим сборочный лист
			//
			//Если ЗаказСобран Тогда
			//
			//	Сборка = Документы.СборочныйЛист.СоздатьДокумент();
			//	Сборка.Заполнить(Новый Структура("Шапка, Товары", 
			//		Новый Структура("Заказ, Склад, Вес, Объем, КоличествоПозиций", ДанныеЗаказа.Заказ, СкладОтправитель, Вес, Объем, КоличествоПозиций),
			//		ТоварыТЗ)); 
			//		
			//	Если 	Сборка.Товары.Количество() И
			//			Не ОбщиеФункции.ЗаписатьОбъектИСообщитьЕслиОшибка(Сборка, РежимЗаписиДокумента.Проведение) Тогда
			//		ОтменитьТранзакцию();
			//		Возврат Ложь; КонецЕсли;
			//	
			//	НовДок.СборочныйЛист = Сборка.Ссылка; КонецЕсли;
			
			// если это последнее перемещение внутреннего заказатогда очистим ячейки чтобы по ним не делались движения, 
			//	так как по ним уже сделало движение сборка, в других случаях ячейку заполним
			
				//Если Не ЗаказСобран Тогда
				//	
				//	ТоварыТЗ.Колонки.Добавить("СкладЯчейкаСборки");
				//	Для Каждого Строка Из ТоварыТЗ Цикл Строка.СкладЯчейкаСборки = ?(Строка[ИмяЯчейка].Пустая(), СкладОтправитель, Строка[ИмяЯчейка]) КонецЦикла; 
				//	
				//ИначеЕсли Не БыстроеПеремещение И ЗаказСобран Тогда
				//	ТоварыТЗ.ЗаполнитьЗначения(Справочники.Ячейки.ПустаяСсылка(), "Ячейка"); КонецЕсли; // сборка уже ячейки списала
			
			// Размажем сборочными листами товары
			
			//ТоварыТЗ = КонтрольПроведения.РазмазатьТаблицуВТаблицеПоМинимальнымРесурсам(ТоварыТЗ, Заказы.ПолучитьТаблицуСобранныхТоваров(Объект.БизнесПроцесс.Заказ, СкладОтправитель),"Номенклатура, Упаковка","Количество");
			
			// Загрузим таблицу
			
			НовДок.Товары.Загрузить(ТоварыТЗ);
			
			// Запишем с проведением
			
			Если Не ОбщиеФункции.ЗаписатьОбъектИСообщитьЕслиОшибка(НовДок, РежимЗаписиДокумента.Проведение) Тогда 
				ОтменитьТранзакцию(); Возврат Ложь КонецЕсли; 
			
			Если БыстроеПеремещение И ОтправитьВСборку Тогда // Отправим сразу в сборку
				
				ТоварыТЗ.Колонки.Добавить("Ячейка", Новый ОписаниеТипов("СправочникСсылка.Ячейки"));
				ТоварыТЗ.ЗаполнитьЗначения(ЯчейкаПолучатель, "Ячейка"); 
			
				Если Не БизнесПроцессы.ПеремещениеТоваров.ОтправитьВСборку(Заказчик.Заказ, СкладПолучатель, ТоварыТЗ) Тогда
					ОтменитьТранзакцию();
					Возврат Ложь; КонецЕсли; КонецЕсли; КонецЕсли; КонецЕсли;
	
	ЗафиксироватьТранзакцию();
	
	Возврат Истина;
	
КонецФункции

&НаСервере
Функция ЕстьПодчиненныеНезавершенныеПроцессы()
	
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1 ИСТИНА ИЗ БизнесПроцесс.ПеремещениеТоваров.ОжидающиеПеремещения ГДЕ Ссылка = &Ссылка И НЕ Процесс.Завершен И НЕ Процесс.ПометкаУдаления");
	Запрос.УстановитьПараметр("Ссылка", Объект.БизнесПроцесс);
	
	Возврат Не Запрос.Выполнить().Пустой();
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьДанныеЗаказНаСервере(ПроцессСсылка)
	
	Заказ=БизнесПроцессы.ПеремещениеТоваров.ПолучитьЗаказ(ПроцессСсылка);
		
	Возврат Новый Структура("СпособРазмещенияБезЗаказа,ИмяДокумента, Заказ", Заказ.СпособРазмещенияБезЗаказа,Заказ.Метаданные().Имя, Заказ);
	
КонецФункции

// ТИПОВЫЕ

&НаКлиенте
Процедура ПоказатьСкрытьАдресацию(Команда)
	
	// Реверснем
	
	КоманднаяПанель.ПодчиненныеЭлементы.ПоказатьСкрытьАдресацию.Пометка = Не КоманднаяПанель.ПодчиненныеЭлементы.ПоказатьСкрытьАдресацию.Пометка;
	
	// Обновим видимость
	
	ФункцииФормЗадач.ВидимостьАдресации(ЭтаФорма);
	
КонецПроцедуры
&НаСервере
Процедура ПрочитатьРеквизиты()
	
	ФункцииБизнесПроцессов.ЗаполнитьДанные(ЭтаФорма, 
		Объект.Ссылка.БизнесПроцесс, 
		Объект.Ссылка);
		
	Заказчик 		= Объект.БизнесПроцесс.Заказчик;
	ЭтоВнутрЗаказ 	= БизнесПроцессы.ПеремещениеТоваров.ЭтоСборкаВнутреннегоЗаказа(Объект.БизнесПроцесс);
	
	// Удалим состояние левые
	
	// 25.04.17 вот внизу закоментарил и написал 1 строку всего , 1 строку Карл!
	таблТова = КонвертацияТипов.ПолучитьТаблицуИзНайденныхСтрокТаблицыЗначений(Товары.Выгрузить(), Новый Структура("Состояние", Перечисления.СостояниеСборкиЗаказа.ОжидаетПеремещения));
	
		//СостояниеОтправитьТовар 	= Перечисления.СостояниеСборкиЗаказа.ОжидаетПеремещения;
		//СостояниеСобранТовар 		= Перечисления.СостояниеСборкиЗаказа.Собрано;
		//таблТова = Товары.Выгрузить();
		//
		//Инд 		= -1;
		//КолСтрок 	= Товары.Количество();
		//
		//Для Ном = 1 По КолСтрок Цикл Инд = КолСтрок - Ном;
		//	
		//	Строка = таблТова[Инд];
		//	
		//	Если 	(НЕ ЭтоВнутрЗаказ И Строка.Состояние <> СостояниеОтправитьТовар) Или
		//			(ЭтоВнутрЗаказ И СостояниеСобранТовар <> СостояниеСобранТовар) Тогда
		//			
		//		таблТова.Удалить(Инд);
		//		
		//	КонецЕсли;
		//КонецЦикла;
	
	// Добавим макс количество
	таблТова.ЗагрузитьКолонку(таблТова.ВыгрузитьКолонку("Количество"), "МаксимальноеКоличество");
	
	Товары.Загрузить(таблТова);
	
	// Установим сборочный лист
	
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1 СборочныйЛист ИЗ РегистрНакопления.ТоварыСобранные.Остатки(,Заказ = &Заказ И Склад = &Склад)");
	Запрос.УстановитьПараметр("Заказ", Объект.Заказ);
	Запрос.УстановитьПараметр("Склад", Объект.Склад);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда СборочныйЛист = Выборка.СборочныйЛист КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура УправлениеВидимостьюДоступностью()
		
	Выполнена = Объект.Выполнена;
	
	//ПоказыватьЯчейки = СкладОтправитель.Ячеестый И Не Объект.БизнесПроцесс.ЗаказСобран;
	//ПоказыватьЯчейки = СкладОтправитель.Ячеестый;
	
	//Элементы.ТоварыЯчейка.Видимость 			= ПоказыватьЯчейки;
	//Элементы.КнопкаЗаполнитьЯчейки.Видимость 	= ПоказыватьЯчейки;
	Элементы.КнопкаОтправитьТовар.Видимость		= Не Выполнена;
	
		Элементы.ОтправитьВСборку.Видимость = 
							БыстроеПеремещение;// И 
		//					СкладПолучатель.Ячеестый И 
		//					//БизнесПроцессы.ПеремещениеТоваров.ПолучитьПроцессРодитель(Объект.БизнесПроцесс) = Неопределено И
		//					ТипЗнч(Заказчик) = Тип("БизнесПроцессСсылка.СборкаЗаказа") И СкладПолучатель = Заказчик.Склад;
						
	Элементы.ЯчейкаПолучатель.Видимость = БыстроеПеремещение И СкладПолучатель.Ячеестый;
	
	Элементы.КнопкаОтправитьТовар.Заголовок = ?(БыстроеПеремещение, 
			"Отправить и принять товар", "Отправить товар");
			
	//Элементы.ГруппаСборочныйЛист.Видимость = Объект.БизнесПроцесс.ЗаказСобран;
	
КонецПроцедуры


// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ЗаполнитьПараметрыСборочногоЕслиНеЗаполнено()
	// Заполняет параметры сборочного листа если они не заполнены.
	
	текВес = 0; текОбъем = 0; текПоз = 0;
	
	Для Каждого Строка Из Товары Цикл текПоз = текПоз + 1;
		
		Коэффициент = ?(НЕ Строка.Упаковка.Пустая(), Строка.Упаковка.Коэффициент * Строка.Количество, Строка.Количество);
			
		текВес = текВес + Строка.Номенклатура.Вес * Коэффициент;
		текОбъем = текОбъем + Строка.Номенклатура.Объем * Коэффициент; КонецЦикла;
	
	Если Не Вес Тогда 				Вес 				= текВес КонецЕсли;
	Если Не Объем Тогда 			Объем 				= текОбъем КонецЕсли;
	Если Не КоличествоПозиций Тогда КоличествоПозиций 	= текПоз КонецЕсли;
	
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// прикрепленные файлы
	ОбновитьВидимостьПрикрепленныхФайловНаСервере();
	
	// информация о товаре
	РаботаСНоменклатурой.ДобавитьОперативнуюИнформациюОТоваре(ЭтаФорма);
	
	// комментарии
	ФункцииБизнесПроцессов.ДобавитьРаботуСКомментариями(ЭтаФорма);

	ПрочитатьРеквизиты();
	
	Если (ТипЗнч(Заказчик) = Тип("БизнесПроцессСсылка.СборкаЗаказа") И СкладПолучатель <> Заказчик.Склад) Тогда
		ОтправитьВСборку 					= Ложь;
		Элементы.ОтправитьВСборку.Видимость = Ложь; КонецЕсли;
	
	// Тупая вставка для Андреечас если отправляет склад 2 на новый склад тогда галку установим
	Если СкладОтправитель.Код = "СК2" И СкладПолучатель.Код = "СКЛ" Тогда
		ОтправитьВСборку = Истина; КонецЕсли;
	
	// Проверим разрешено или нет быстрое перемещение между складами
	
	Элементы.БыстроеПеремещение.Доступность = Справочники.Склады.РазрешеноБыстроеПеремещение(СкладОтправитель, СкладПолучатель);
	
	// Установим ячейку
	
	Если ЯчейкаПолучатель.Пустая() И СкладПолучатель.Ячеестый Тогда
		ЯчейкаПолучатель = СкладПолучатель.ЯчейкаПеремещенияПоУмолчанию;
	КонецЕсли;
	
	ОтправитьВСборку = НЕ (ТипЗнч(Заказчик.Заказ) = Тип("ДокументСсылка.ВнутреннийЗаказ") И СкладПолучатель = Заказчик.Заказ.Заказчик);
	
	КонвертацияТипов.ВыполнитьВыражениеВКаждойСтрокеТаблицы(Товары, "
		|Строка.Артикул = Строка.Номенклатура.Артикул;
	    |Строка.Сборщик = Неопределено;");
	
КонецПроцедуры
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	
	ДанныеЗаказа = ПолучитьДанныеЗаказНаСервере(Объект.БизнесПроцесс);
	
	//ДОЛОЙ все эти старые формы!
	
	// Если это по старому тогда откроем форму по старому
	//Если Не ДанныеЗаказа.СпособРазмещенияБезЗаказа И НЕ ДанныеЗаказа.ИмяДокумента = "ВнутреннийЗаказ" Тогда
	//	
	//	Отказ = Истина;
	//	ОткрытьФорму("БизнесПроцесс.ПеремещениеТоваров.Форма.Задача_ОтправитьТовар_СЗаказом",  Новый Структура("Ключ", Параметры.Ключ), ВладелецФормы, Окно,, ОписаниеОповещенияОЗакрытии);
	//	Возврат; 
	//КонецЕсли;
	
	// комментарии
	ФункцииБизнесПроцессовКлиент.ПолучитьМассивКомментариев(ЭтаФорма, Объект.БизнесПроцесс);
			
	ФункцииФормЗадач.ПриОткрытии(Объект, ЭтаФорма, Отказ);
	
	УправлениеВидимостьюДоступностью();
	
КонецПроцедуры
&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ФункцииФормЗадач.ПослеЗаписи(Объект, ЭтаФорма, ПараметрыЗаписи);
	
	УправлениеВидимостьюДоступностью();
	
КонецПроцедуры


// КОМАНДЫ

&НаКлиенте
Процедура ОтправитьТовар(Команда)
	
	// Проверим что это не верхний БП который ждет товар от филиалов
	
	Если ЕстьПодчиненныеНезавершенныеПроцессы() Тогда
		ОткрытьФорму("БизнесПроцесс.ПеремещениеТоваров.Форма.СказатьЧтоНужноПодождать", Новый Структура("Процесс", Объект.БизнесПроцесс), ЭтаФорма); Закрыть(); Возврат; КонецЕсли;
	
	// Проверим ячейки
		
	Если 	БыстроеПеремещение И
			Элементы.ЯчейкаПолучатель.Видимость И 
			Товары.Итог("Количество") И 
			ЯчейкаПолучатель.Пустая() Тогда
		ОбщиеФункции.СообщитьТекст("Не заполнена ячейка получатель!", "ЯчейкаПолучатель"); Возврат; КонецЕсли;
		
	// Выполним задачу и закроем форму
	
	БылОтказ = Ложь; Если Записать(Новый Структура("ВыполнитьЗадачу",Истина)) Тогда
		Закрыть(); КонецЕсли

КонецПроцедуры
&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ВыполнитьЗадачу = ПараметрыЗаписи.Свойство("ВыполнитьЗадачу");
	
	Если 	ВыполнитьЗадачу = Истина И 
			Не СформироватьИПровестиОтправкуТовараИПроверитьБП() Тогда
			
		Отказ = Истина;
		
	ИначеЕсли 	Не ВыполнитьЗадачу 
				//Не ФункцииФормДокументов.ЗапомнитьЯчейкиВЗадаче(Объект.Ссылка, Товары) 
				Тогда
			
		Отказ = Истина;
			
	КонецЕсли;
	
КонецПроцедуры



// ИНФОРМАЦИЯ О ТОВАРЕ

&НаКлиенте
Процедура ТоварыПриАктивизацииСтроки(Элемент)
	
	// информация о товаре
	ОбработатьОтображениеИнформацииОТоваре()	
	 	
КонецПроцедуры
&НаСервере
Процедура ОбработатьОтображениеИнформацииОТоваре() Экспорт
	РаботаСНоменклатурой.ОбработатьОтображениеИнформацииОТоваре(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ИнфТовараТекстHTMLПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	РаботаСНоменклатуройКлиент.ИнфТовараТекстHTMLПриНажатии(ЭтаФорма, Элемент, ДанныеСобытия, СтандартнаяОбработка);
КонецПроцедуры
&НаКлиенте
Процедура ИнфТовараЗаголовокHTMLПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	РаботаСНоменклатуройКлиент.ИнфТовараЗаголовокHTMLПриНажатии(ЭтаФорма, Элемент, ДанныеСобытия, СтандартнаяОбработка);
КонецПроцедуры

 &НаКлиенте
Процедура ПоказатьСкрытьИнфОТоваре(Команда)
	РаботаСНоменклатуройКлиент.ПоказатьСкрытьИнфОТоваре(ЭтаФорма);
КонецПроцедуры
&НаКлиенте
Процедура НастройкаИнфОТоваре(Команда) 
	РаботаСНоменклатуройКлиент.НастройкаИнфОТоваре(ЭтаФорма);
КонецПроцедуры

// КОММЕНТАРИИ

&НаКлиенте
Процедура КомандаПоказатьКомментарий(Команда)
	ФункцииБизнесПроцессовКлиент.КомандаПоказатьКомментарий(ЭтаФорма);
КонецПроцедуры

// ПЕЧАТЬ СБОРОЧНОГО ЛИСТА

&НаКлиенте
Процедура ПечатьСборочныйЛист(Команда) ПолучитьТабличныйДокумент().Показать() КонецПроцедуры
&НаКлиенте
Процедура ПечатьСборочногоЛистаСортАртикул(Команда) ПолучитьТабличныйДокумент("Артикул").Показать() КонецПроцедуры


&НаСервере
Функция ПолучитьТабличныйДокумент(Сортировка = "Ячейка")
	
	ТабДокумент 	= Новый ТабличныйДокумент;
	Макет 			= ПолучитьОбщийМакет("СборочныйЛист");
	
	ОбластьШапка 			= Макет.ПолучитьОбласть("Шапка");
	ОбластьКомментарий		= Макет.ПолучитьОбласть("Комментарий");
	ОбластьЗаголовокТаблицы = Макет.ПолучитьОбласть("ЗаголовокТаблицы");
	ОбластьСтрока 			= Макет.ПолучитьОбласть("Строка");
	ОбластьИтого 			= Макет.ПолучитьОбласть("Итого");
	
	// Шапка
	Если ТипЗнч(Объект.БизнесПроцесс.Заказчик.Заказ) <> Тип("ДокументСсылка.ВнутреннийЗаказ") Тогда
		ОбластьШапка.Параметры.ПредставлениеКонтрагента = ФормированиеПечатныхФорм.ОписаниеОрганизации(ФормированиеПечатныхФорм.СведенияОЮрФизЛице(Объект.БизнесПроцесс.Заказчик.Заказ.Контрагент, ТекущаяДата()), "ПолноеНаименование,ЮридическийАдрес",,Символы.ПС);
	Иначе
		ОбластьШапка.Параметры.ПредставлениеКонтрагента = Объект.БизнесПроцесс.Заказчик.Заказ;
	КонецЕсли;
	ОбластьШапка.Параметры.Номер 			= Объект.БизнесПроцесс.Заказчик.Заказ.Номер;
	ОбластьШапка.Параметры.Дата 			= Объект.Дата;
	ОбластьШапка.Параметры.СинонимДокумента = "Сборочный лист";
	ОбластьШапка.Параметры.Склад	= Объект.БизнесПроцесс.СкладОтправитель;
	
	//Попытка
	//	ОбластьЗаголовокТаблицы.Параметры.ТипЦен 	= Строка(Объект.БизнесПроцесс.Заказчик.Заказ.ТипЦен);
	//	ОбластьЗаголовокТаблицы.Параметры.Цена 		= "Цена, " + Строка(Объект.БизнесПроцесс.Заказчик.Заказ.Валюта);
	//Исключение
	//	ОбластьЗаголовокТаблицы.Параметры.ТипЦен 	= "";
	//	ОбластьЗаголовокТаблицы.Параметры.Цена 		= "Цена";
	//КонецПопытки;
	
	ТабДокумент.Вывести(ОбластьШапка);
	
	// Сформируем комментарий
	
	Комменты = БизнесПроцессы.ПеремещениеТоваров.ПолучитьМассивКомментариев(Объект.БизнесПроцесс);
	Для Каждого Коммент Из Комменты Цикл
		ОбластьКомментарий.Параметры.Заполнить(Коммент);
		Если Коммент.Исполнитель.Пустая() Тогда
			ОбластьКомментарий.Параметры.Исполнитель = "Последний комментарий:";
		Иначе
			ОбластьКомментарий.Параметры.Исполнитель = Строка(Коммент.Исполнитель) + " (" + Формат(Коммент.ДатаВыполнения,"ДЛФ=DDT") + "):";
		КонецЕсли;
		ТабДокумент.Вывести(ОбластьКомментарий);
	КонецЦикла;
	
	ТабДокумент.Вывести(ОбластьЗаголовокТаблицы);

	
	// Отсортируем чтобы бегали быстрее
	
	ТаблВывода = Товары.Выгрузить();
	//ТаблВывода.Колонки.Добавить("СортировкаПоУмолчанию", Новый ОписаниеТипов("Строка"));
	//Для Каждого Строка ИЗ ТаблВывода Цикл Строка.СортировкаПоУмолчанию = Строка.Ячейка.Сортировка; КонецЦикла;
	//ТаблВывода.Сортировать("СортировкаПоУмолчанию, " + Сортировка);
	
	// Выводим в таблицу
	
	Ном = 0;
	//ИтогПроход 	= 0;
	//ИтогСекция 	= 0;
	//ИтогЯрус 	= 0;
	//ИтогПоддон 	= 0;
	ПустаяУпаковка = Справочники.УпаковкиНоменклатуры.ПустаяСсылка();
	Для каждого Строка Из ТаблВывода Цикл Ном = Ном + 1;
	
		ОбластьСтрока.Параметры.Заполнить(Строка);
		ОбластьСтрока.Параметры.Номер 		= Ном;
		ОбластьСтрока.Параметры.Артикул 	= Строка.Номенклатура.Артикул;
		
		Если Строка.Упаковка  = ПустаяУпаковка Тогда
			ЕдиницаИзмерения = Строка.Номенклатура.ЕдиницаИзмерения;
		Иначе
			ЕдиницаИзмерения = Строка.Упаковка;
		КонецЕсли;
		
		ОбластьСтрока.Параметры.ЕдиницаИзмерения = ЕдиницаИзмерения; 
		
		//Если Строка.Ячейка.Пустая() Тогда
		//	
		//	ОбластьСтрока.Параметры.Ячейка = Строка.Склад;
		//	
		//КонецЕсли;
		
		ТабДокумент.Вывести(ОбластьСтрока);
		
		// Подсчитаем итоги
		
		//ИтогПроход 	= ИтогПроход + ПодсчитатьИтогЯчейки(ОтрПроход, Строка.Проход);
		//ИтогСекция 	= ИтогСекция + ПодсчитатьИтогЯчейки(ОтрСекция, Строка.Проход + "." + Строка.Секция);
		//ИтогЯрус 	= ИтогЯрус + ПодсчитатьИтогЯчейки(ОтрЯрус, Строка.Проход + "." + Строка.Секция + "." + Строка.Ярус);
		//ИтогПоддон 	= ИтогПоддон + ПодсчитатьИтогЯчейки(ОтрПоддон, Строка.Проход + "." + Строка.Секция + "." + Строка.Ярус + "." + Строка.Поддон);
		
	КонецЦикла; 
	
	ОбластьИтого.Параметры.ДатаФормирования = Формат(ТекущаяДата(),"ДЛФ=DDT");
	//ОбластьИтого.Параметры.КолЯчеек		 	= Строка(ИтогПроход) + "." + Строка(ИтогСекция) + "." + Строка(ИтогЯрус) + "." + Строка(ИтогПоддон);
	//ОбластьИтого.Параметры.КолНоменклатура 	= ВсегоКол;
	ТабДокумент.Вывести(ОбластьИтого);
	
	// Настрим просмотры
	
	ТабДокумент.ТолькоПросмотр 	= Истина;
	ТабДокумент.ОтображатьСетку = Ложь;
	
	Возврат ТабДокумент;
	
КонецФункции

&НаКлиенте
Процедура БыстроеПеремещениеПриИзменении(Элемент)
	
	УправлениеВидимостьюДоступностью();
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПередНачаломИзменения(Элемент, Отказ)
	
	Элементы.ТоварыКоличество.МаксимальноеЗначение = Элемент.ТекущиеДанные.МаксимальноеКоличество;
			
КонецПроцедуры


#Область Прикрепленные_файлы

&НаКлиенте
Процедура УдалитьПрикрепленныеФайлыНажатие(Элемент)
	
	ПрикрепленныеФайлыКлиент.УдалитьНажатие(Объект.Заказ, ЭтаФорма, Элемент);
	
КонецПроцедуры
&НаКлиенте
Процедура ПрикрепленныеФайлыНажатиеСкрепка(Элемент)
	
	ПрикрепленныеФайлыКлиент.НажатиеСкрепка(Объект.Заказ, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПрикрепленныйФайл(Элемент)
	
	ПрикрепленныеФайлыКлиент.ОткрытьПрикрепленныйФайл(Элемент.Имя);
	
КонецПроцедуры
&НаКлиенте
Процедура ПоказатьПрикрееленныеФайлы(Элемент)
	
	ПрикрепленныеФайлыКлиент.ПоказатьПрикрепленныеФайлы(Объект.Заказ, ЭтаФорма, Элемент);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьВидимостьПрикрепленныхФайловНаСервере()
	
	ПрикрепленныеФайлы.Иницилизировать(Объект.Заказ, ЭтаФорма);
	
КонецПроцедуры
&НаКлиенте
Процедура ОбновитьВидимостьПрикрепленныхФайлов() Экспорт
	
	ОбновитьВидимостьПрикрепленныхФайловНаСервере();
	
КонецПроцедуры


#КонецОбласти
